test_load/test/google_maps.yml
config:
  target: "https://rahulshettyacademy.com"
  tls:
    rejectUnauthorized: false
  http:
    timeout: 120
  phases:
    - duration: 30
      arrivalRate: 5
      name: Warm up
    - duration: 60
      arrivalRate: 5
      rampTo: 20
      name: Ramp up load
    - duration: 100
      arrivalRate: 20
      name: Sustained load
  payload:
    path: "maps_data.csv"
    fields:
      - "lat"
      - "long"
      - "name"
      - "phno"
      - "language"

scenarios:
  - name: "Add, get and delete a place"
    flow:
      - post:  # post an address
          url: "/maps/api/place/add/json"
          params:
            key : "qaclick123"
          json:
            location : 
              lat: "{{ lat }}"
              lng: "{{ long }}"
            accuracy: 50
            name: "{{ name }}"
            phone_number : "{{ phno }}"
            address : "29, side layout, cohen 09"
            website: "http://google.com"
            language : "{{ language }}"
          capture:
            - json: "$.place_id"
              as: "placeId"
      - get: # fetch place id
          url: "/maps/api/place/get/json"
          params:
            key : "qaclick123"
            place_id : "{{ placeId }}"
      - delete:  # delete address by place id
          url: "/maps/api/place/delete/json"
          params:
            key : "qaclick123"
            place_id : "{{ placeId }}"